zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_ipcc.c
/** @addtogroup IPCC_Exported_Functions_Group3
  *  @brief   IPCC Peripheral State and Error functions
  *
@verbatim
  ==============================================================================
            ##### Peripheral State and Error functions #####
  ==============================================================================
    [..]
    This subsection permit to get in run-time the status of the peripheral
    and the data flow.

@endverbatim
  * @{
  */

/**
  * @brief Return the IPCC handle state.
  * @param  hipcc IPCC handle
  * @retval IPCC handle state
  */
HAL_IPCC_StateTypeDef HAL_IPCC_GetState(IPCC_HandleTypeDef const *const hipcc)
{
  return hipcc->State;
}

/**
  * @brief  Get number of IPCC channels
  * @param  hipcc IPCC handle
  * @retval number of IPCC channels, 0 if IPCC is not initialized
  */
uint32_t HAL_IPCC_GetChannelNumber(const IPCC_HandleTypeDef *hipcc)
{
  uint32_t channelNumber = 0;

  if (hipcc != NULL)
  {
    channelNumber = hipcc->channelNumber;
  }
  return channelNumber;
}

/**
  * @}
  */

/** @addtogroup IPCC_Exported_Functions_Group4
  *  @brief   RIF protection configuration functions
  *
@verbatim
  ==============================================================================
            ##### RIF protection configuration functions #####
  ==============================================================================
    [..]
    This subsection allows to get/set the RIF protection configuration made of
    security, privilege, and cid (compartment id) attributes.

@endverbatim
  * @{
  */

/**
  * @brief Configure the RIF security and privilege protections of an IPCC channel
  * @param hipcc IPCC handle
  * @param LocalProcessorId local processor endpoint
  *          @arg IPCC_CPU1
  *          @arg IPCC_CPU2
  * @param ChannelIndex Channel number
  *          This parameter can be one of the following values:
  *            @arg IPCC_CHANNEL_1: IPCC Channel 1
  *            ...
  *            @arg IPCC_CHANNEL_16: IPCC Channel 16
  * @param ChannelAttributes RIF security and privilege protections attributes.
  *          Combination (logical OR) of
  *            @arg IPCC_CHANNEL_PRIV | IPCC_CHANNEL_NPRIV
  *          with
  *            @arg IPCC_CHANNEL_SEC  | IPCC_CHANNEL_NSEC
  * @retval HAL_OK if the configuration is successfully set, HAL_ERROR otherwise
  */
HAL_StatusTypeDef HAL_IPCC_ConfigChannelAttributes(const IPCC_HandleTypeDef *hipcc, uint32_t LocalProcessorId,
                                                   uint32_t ChannelIndex, uint32_t ChannelAttributes)
{
  HAL_StatusTypeDef err;
  __IO uint32_t *regaddr;

  if (hipcc != NULL)
  {
    assert_param(IS_IPCC_ALL_INSTANCE(hipcc->Instance));

    /* Configure privilege attribute */
    if ((ChannelAttributes & IPCC_CHANNEL_PRIV_SELECT) != 0UL)
    {
      regaddr = (LocalProcessorId == IPCC_CPU1) ? &hipcc->Instance->C1PRIVCFGR : &hipcc->Instance->C2PRIVCFGR;

      if ((ChannelAttributes & IPCC_CHANNEL_PRIV) == IPCC_CHANNEL_PRIV)
      {
        *regaddr |= 1UL << ChannelIndex;
      }
      else
      {
        *regaddr &= ~(1U << ChannelIndex);
      }
    }

    /* Configure secure attribute */
    if ((ChannelAttributes & IPCC_CHANNEL_SEC_SELECT) != 0UL)
    {
      regaddr = (LocalProcessorId == IPCC_CPU1) ? &hipcc->Instance->C1SECCFGR : &hipcc->Instance->C2SECCFGR;

      if ((ChannelAttributes & IPCC_CHANNEL_SEC) == IPCC_CHANNEL_SEC)
      {
        *regaddr |= 1UL << ChannelIndex;
      }
      else
      {
        *regaddr &= ~(1UL << ChannelIndex);
      }
    }
    err = HAL_OK;
  }
  else
  {
    err = HAL_ERROR;
  }

  return err;
}

/**
  * @brief Get the configuration of the RIF security and privilege protections of an IPCC channel
  * @param hipcc IPCC handle
  * @param LocalProcessorId local processor endpoint
  *          @arg IPCC_CPU1
  *          @arg IPCC_CPU2
  * @param ChannelIndex Channel number
  *          This parameter can be one of the following values:
  *            @arg IPCC_CHANNEL_1: IPCC Channel 1
  *            ...
  *            @arg IPCC_CHANNEL_16: IPCC Channel 16
  * @param pChannelAttributes pointer to the output RIF security and privilege protections attributes.
  *          Combination (logical OR) of
  *            @arg IPCC_CHANNEL_PRIV | IPCC_CHANNEL_NPRIV
  *          with
  *            @arg IPCC_CHANNEL_SEC  | IPCC_CHANNEL_NSEC
  * @retval HAL_OK if the configuration is successfully read, HAL_ERROR otherwise
  */
HAL_StatusTypeDef HAL_IPCC_GetConfigChannelAttributes(const IPCC_HandleTypeDef *hipcc, uint32_t LocalProcessorId,
                                                      uint32_t ChannelIndex, uint32_t *pChannelAttributes)
{
  HAL_StatusTypeDef err;
  __I uint32_t *regaddr;

  if ((hipcc != NULL) && (pChannelAttributes != NULL))
  {
    assert_param(IS_IPCC_ALL_INSTANCE(hipcc->Instance));
    *pChannelAttributes = 0;

    /* Privilege attribute */
    regaddr = (LocalProcessorId == IPCC_CPU1) ? &hipcc->Instance->C1PRIVCFGR : &hipcc->Instance->C2PRIVCFGR;
    if ((*regaddr & (1UL << ChannelIndex)) != 0UL)
    {
      *pChannelAttributes |= IPCC_CHANNEL_PRIV;
    }
    else
    {
      *pChannelAttributes |= IPCC_CHANNEL_NPRIV;
    }

    /* Secure attribute */
    regaddr = (LocalProcessorId == IPCC_CPU1) ? &hipcc->Instance->C1SECCFGR : &hipcc->Instance->C2SECCFGR;
    if ((*regaddr & (1UL << ChannelIndex)) != 0UL)
    {
      *pChannelAttributes |= IPCC_CHANNEL_SEC;
    }
    else
    {
      *pChannelAttributes |= IPCC_CHANNEL_NSEC;
    }
    err = HAL_OK;
  }
  else
  {
    err = HAL_ERROR;
  }

  return err;
}

/**
  * @brief Configure the RIF CID protection
  * @param hipcc IPCC handle
  * @param Item local processor endpoint
  *          @arg IPCC_CPU1
  *          @arg IPCC_CPU2
  * @param Attributes RIF CID protection attribute
  *          @arg IPCC_CPU_CID_DISABLE
  *          @arg IPCC_CPU_CID_STATIC_0
  *          ...
  *          @arg IPCC_CPU_CID_STATIC_7
  * @retval HAL_OK if the configuration is successfully set, HAL_ERROR otherwise
  */
HAL_StatusTypeDef HAL_IPCC_ConfigAttributes(const IPCC_HandleTypeDef *hipcc, uint32_t Item, uint32_t Attributes)
{
  HAL_StatusTypeDef err;
  __IO uint32_t *regaddr;
  uint32_t cid;

  if (hipcc != NULL)
  {
    assert_param(IS_IPCC_ALL_INSTANCE(hipcc->Instance));

    /* Configure CID attribute */
    regaddr = (Item == IPCC_CPU1) ? &hipcc->Instance->C1CIDCFGR : &hipcc->Instance->C2CIDCFGR;

