zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_ipcc.c
    if ((Attributes & IPCC_CPU_CID_DISABLE_SELECT) != 0U)
    {
      *regaddr &= ~IPCC_C1CIDCFGR_CFEN;
    }
    else if ((Attributes & IPCC_CPU_CID_STATIC_SELECT) != 0U)
    {
      cid = (Attributes & IPCC_CPU_CID_VAL_Msk) >> IPCC_CPU_CID_VAL_Pos;
      *regaddr = IPCC_C1CIDCFGR_CFEN | (cid << IPCC_C1CIDCFGR_CID_Pos);
    }
    else
    {
      /* Nothing to do */
    }
    err = HAL_OK;
  }
  else
  {
    err = HAL_ERROR;
  }

  return err;
}

/**
  * @brief Get the configuration of the RIF CID protection
  * @param hipcc IPCC handle
  * @param Item local processor endpoint
  *          @arg IPCC_CPU1
  *          @arg IPCC_CPU2
  * @param pAttributes pointer to the output RIF CID protection attribute
  *          @arg IPCC_CPU_CID_DISABLE
  *          @arg IPCC_CPU_CID_STATIC_0
  *          ...
  *          @arg IPCC_CPU_CID_STATIC_7
  * @retval HAL_OK if the configuration is successfully read, HAL_ERROR otherwise
  */
HAL_StatusTypeDef HAL_IPCC_GetConfigAttributes(const IPCC_HandleTypeDef *hipcc, uint32_t Item, uint32_t *pAttributes)
{
  HAL_StatusTypeDef err;
  __I uint32_t *regaddr;
  uint32_t cid;

  if ((hipcc != NULL) && (pAttributes != NULL))
  {
    assert_param(IS_IPCC_ALL_INSTANCE(hipcc->Instance));

    /* CID attribute */
    regaddr = (Item == IPCC_CPU1) ? &hipcc->Instance->C1CIDCFGR : &hipcc->Instance->C2CIDCFGR;
    if ((*regaddr & IPCC_C1CIDCFGR_CFEN) == 0U)
    {
      *pAttributes = IPCC_CPU_CID_DISABLE;
    }
    else
    {
      cid = (*regaddr & IPCC_C1CIDCFGR_CID_Msk) >> IPCC_C1CIDCFGR_CID_Pos;
      *pAttributes = IPCC_CPU_CID_STATIC_SELECT | (cid << IPCC_CPU_CID_VAL_Pos);
    }
    err = HAL_OK;
  }
  else
  {
    err = HAL_ERROR;
  }

  return err;
}

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup IPCC_Private_Functions
  * @{
  */

/**
  * @brief  Mask IPCC interrupts.
  * @param  hipcc IPCC handle
  * @param  ChannelIndex Channel number
  *          This parameter can be one of the following values:
  *            @arg IPCC_CHANNEL_1: IPCC Channel 1
  *            ...
  *            @arg IPCC_CHANNEL_16: IPCC Channel 16
  * @param  ChannelDir Channel direction
  */
void IPCC_MaskInterrupt(IPCC_HandleTypeDef *hipcc, uint32_t ChannelIndex, IPCC_CHANNELDirTypeDef ChannelDir)
{
  IPCC_CommonTypeDef *currentInstance = IPCC_GetCurrentInstance(hipcc);

  if (ChannelDir == IPCC_CHANNEL_DIR_TX)
  {
    /* Mask interrupt */
    currentInstance->MR |= ((uint32_t)IPCC_MR_CH1FM_Msk << (ChannelIndex & CHANNEL_INDEX_MSK));
  }
  else
  {
    /* Mask interrupt */
    currentInstance->MR |= ((uint32_t)IPCC_MR_CH1OM_Msk << (ChannelIndex & CHANNEL_INDEX_MSK));
  }
}
/**
  * @brief  Unmask IPCC interrupts.
  * @param  hipcc IPCC handle
  * @param  ChannelIndex Channel number
  *          This parameter can be one of the following values:
  *            @arg IPCC_CHANNEL_1: IPCC Channel 1
  *            ...
  *            @arg IPCC_CHANNEL_16: IPCC Channel 16
  * @param  ChannelDir Channel direction
  */
void IPCC_UnmaskInterrupt(const IPCC_HandleTypeDef *hipcc, uint32_t ChannelIndex, IPCC_CHANNELDirTypeDef ChannelDir)
{
  IPCC_CommonTypeDef *currentInstance = IPCC_GetCurrentInstance(hipcc);

  if (ChannelDir == IPCC_CHANNEL_DIR_TX)
  {
    /* Unmask interrupt */
    currentInstance->MR &= ~(IPCC_MR_CH1FM_Msk << (ChannelIndex & CHANNEL_INDEX_MSK));
  }
  else
  {
    /* Unmask interrupt */
    currentInstance->MR &= ~(IPCC_MR_CH1OM_Msk << (ChannelIndex & CHANNEL_INDEX_MSK));
  }
}

/**
  * @brief Reset all callbacks of the handle to NULL.
  * @param  hipcc IPCC handle
  */
void IPCC_SetDefaultCallbacks(IPCC_HandleTypeDef *hipcc)
{
  uint32_t i;
  /* Set all callbacks to default */
  for (i = 0; i < IPCC_CHANNEL_NUMBER; i++)
  {
    hipcc->ChannelCallbackRx[i] = HAL_IPCC_RxCallback;
    hipcc->ChannelCallbackTx[i] = HAL_IPCC_TxCallback;
  }
}

/**
  * @brief Reset IPCC register to default value for the concerned instance.
  * @param  hipcc IPCC handle
  */
void IPCC_Reset_Register(IPCC_HandleTypeDef *hipcc)
{
  IPCC_CommonTypeDef *Instance = IPCC_GetCurrentInstance(hipcc);

  /* Disable RX and TX interrupts */
  Instance->CR  = 0x00000000U;

  /* Mask RX and TX interrupts */
  Instance->MR  = (IPCC_ALL_TX_BUF | IPCC_ALL_RX_BUF);

  /* Clear RX status */
  Instance->SCR = IPCC_ALL_RX_BUF;
}

/**
  * @brief Return the current core endpoint of the current IPCC instance
  * @param  hipcc IPCC handle
  */
IPCC_CommonTypeDef *IPCC_GetCurrentInstance(const IPCC_HandleTypeDef *hipcc)
{

#if defined(IPCC1)
  if (hipcc->Instance == IPCC1)
  {
#if defined(CORE_CM33)
    return IPCC1_C2;
#else   /* CORE_CM33 */
    return IPCC1_C1;
#endif  /* CORE_CM33 */
  }
#endif /* IPCC1 */

#if  defined(IPCC2)
  if (hipcc->Instance == IPCC2)
  {
#if defined (CORE_CA35) || defined(CORE_CM33)
    return IPCC2_C2;
#else   /* (CORE_CA35) || (CORE_CM33) */
    return IPCC2_C1;
#endif  /* (CORE_CA35) || (CORE_CM33) */
  }
#endif /* IPCC2 */

  return NULL;
}

/**
  * @brief Return the other core endpoint of the current IPCC instance
  * @param  hipcc IPCC handle
  */
IPCC_CommonTypeDef *IPCC_GetOtherInstance(const IPCC_HandleTypeDef *hipcc)
{
  const IPCC_CommonTypeDef *currentInstance = IPCC_GetCurrentInstance(hipcc);

#if defined (IPCC1)
  if (currentInstance == IPCC1_C1)
  {
    return  IPCC1_C2;
  }
  else
  {
    return IPCC1_C1;
  }
#endif /* IPCC1 */

#if defined (IPCC2)
  if (currentInstance == IPCC2_C1)
  {
    return IPCC2_C2;
  }
  else
  {
    return IPCC2_C1;
  }
#endif /* IPCC2 */

  return NULL;
}

/**
  * @}
  */

#endif /* HAL_IPCC_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */
#endif /* IPCC || IPCC1 || IPCC2 */
